app/controllers/events_controller.rb

  def index
    @events = Event.where(user_id: current_user.id)
---
SELECT "events".* FROM "events" WHERE "events"."user_id" = ?  [["user_id", 4]]

  def create
    @event = Event.new(event_params)
    @event.user_id = current_user.id
    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("title", "description", "income", "expense", "start_date", "end_date", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    event = Event.find(params[:id])
    @events = Event.where(user_id: current_user.id)
    respond_to do |format|
      if @event.update(event_params)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 72], ["LIMIT", 1]]
UPDATE "events" SET "description" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["description", ""], ["updated_at", "2020-11-30 07:05:41.290639"], ["id", 72]]